//Даны два числа. Показать большее и меньшее число
int a = 31;
int b = 52;
if (a > b)
{
    Console.WriteLine("a = " + a);
    Console.WriteLine("b = " + b);
}
else
{
    Console.WriteLine("b = " + b);
    Console.WriteLine("a = " + a);
}
